# 리스트 함수
# len() 	    길이를 구하는 함수
# sorted()	    오름차순 정렬
# min()	        리스트에서 가장 작은 요소 찾기
# max()      	리스트에서 가장 큰 요소 찾기
# .insert()	    리스트의 특정 위치에 요소 삽입
# .append()	    리스트의 마지막에 요소 추가
# .extend()	    리스트 합치기
# .pop()   	    인덱스로 요소 삭제. del 연산자와 동일 효과
# .remove()	    값으로 요소 삭제
# .index()	    값으로 요소 인덱스 찾기
# .sort()	    리스트 오름차순 정렬
# .reverse()	리스트 거꾸로 뒤집기
# .count()	    리스트에 해당 값의 요소 개수
# .clear() 	    모든 요소 삭제


# len() 	    길이를 구하는 함수

# sorted()	    오름차순 정렬

# min()	        리스트에서 가장 작은 요소 찾기

# max()      	리스트에서 가장 큰 요소 찾기

# .insert()	    리스트의 특정 위치에 요소 삽입

# .append()	    리스트의 마지막에 요소 추가

# .extend()	    리스트 합치기

# .pop()   	    인덱스로 요소 삭제. del 연산자와 동일 효과

# .remove()	    값으로 요소 삭제

# .index()	    값으로 요소 인덱스 찾기

# .sort()	    리스트 오름차순 정렬

# .reverse()	리스트 거꾸로 뒤집기

# .count()	    리스트에 해당 값의 요소 개수

# .clear() 	    모든 요소 삭제
