# 중첩 for문

# **********
# **********
# **********
# **********
# **********
# **********
# **********
# **********
# **********
# **********

# 실행결과 A
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("**********")
print("------------------------------")

# for 1개를 이용하여 출력

for i in range(1, 11, 1):
    print("**********")

print("------------------------------")

# for 2개를 이용하여 출력
for i in range(1, 11, 1):
    for j in range(1, 11, 1):
        print("*", end="")
    print()  # 줄바꿈을 위해서


print("------------------------------")

# 실행결과 B
for i in range(1, 11, 1):
    for j in range(1, i, 1):
        print("*", end="")
    print()  # 줄바꿈을 위해서

print("------------------------------")

# 실행결과 C
for i in range(1, 11, 1):
    for j in range(1, i+1, 1):
        print(" ", end="")

    for k in range(i+1, 11, 1):
        print("*", end="")

    print()  # 줄바꿈을 위해서
